app/controllers/gigs_controller.rb

  def show
    @gig = Gig.find(params[:id])
    @proposals = @gig.proposals.order("created_at DESC").joins(:user)
    @awarded_proposal = Proposal.where(id: @gig.awarded_proposal).first
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" IS NULL ORDER BY "proposals"."id" ASC LIMIT $1

  def create
    @gig = Gig.new(gig_params)
    @gig.user = current_user
    if @gig.save
      User.all.each do |user|
---
INSERT INTO "gigs" ("name", "description", "budget", "location", "latitude", "longitude", "created_at", "updated_at", "category_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "users".* FROM "users"

  def update
    @gig = Gig.find(params[:id])
    if current_user == @gig.user
      @gig.update(gig_params)
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2
UPDATE "gigs" SET "awarded_proposal" = $1, "updated_at" = $2 WHERE "gigs"."id" = $3