app/views/gigs/_gig_form.html.erb

SELECT "categories".* FROM "categories"
---

            <%= f.select :category_id, options_from_collection_for_select(Category.all, :id, :name), {}, class: "form-control input-lg" %>

SELECT "skills".* FROM "skills"
---
            <!-- <%= f.text_area :skill_list, rows: 3, class: "form-control" %> -->
            <%= f.select :skill_list, options_from_collection_for_select(Skill.all, :name, :name), {}, class: "form-control input-lg" %>