app/views/gigs/mygigs.html.erb

          <td>
            <%= gig.proposals.count %>
---
SELECT COUNT(*) FROM "proposals" WHERE "proposals"."gig_id" = $1